{"name":"Collins Mbathi","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Collins Mbathi - ","headerTaglineThree":"Software Engineer  , Technical Writer","headerTaglineFour":"and a Community Advocate","showBlog":true,"darkMode":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/Collins87mbathi"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/collins-mbathi-a39a221b9/"},{"id":"3","title":"Twitter","link":"https://twitter.com/collinsperez6"},{"id":"4","title":"Blog","link":"https://dev.to/collins87mbathi"},{"id":"5","title":"Email","link":"mailto:collinsmbathi@gmail.com"}],"projects":[{"id":"1","title":"Food Delivery Application","description":"The food delivery application would allow users to order food from restaurants and have it delivered to their location. The app would need to be integrated with a delivery service and would need to allow for payment via credit card or Mpesa.","imageSrc":"/images/projects/foodapplication.svg","url":"https://perezfoods.netlify.app/"},{"id":"2","title":"Interior Design Application","description":"An interior design website is aesthetically pleasing and user friendly. It has a clean and simple design, and be easy to navigate. The website showcase the interior designer’s work, and provide information about their services. ","imageSrc":"/images/projects/interwood.svg","url":"https://interwoodinteriordesigns.netlify.com/"},{"id":"3","title":"Booking Application","description":"This Application allow users to book appointments or events directly from their mobile devices.  This would streamline the booking process and make it more convenient for both businesses and customers","imageSrc":"/images/projects/bookingapp.svg","url":"https://github.com/Collins87mbathi/bookingapp_ui"},{"id":"4","title":"User Chat Engine","description":"The User Chat Engine is an application that enables users to chat with each other in real time. It provides a platform for users to communicate with each other, share information and collaborate on projects. The application is available on mobile and desktop devices.","imageSrc":"/images/projects/chat_user.svg","url":"https://github.com/Collins87mbathi/chat-engine-react"},{"id":"5","title":"E-commerce Backery","description":"The Bakery Ecommerce application is a web-based application that allows users to purchase and order baked goods online. The application provides a user-friendly interface for browsing and selecting items, as well as a shopping cart for managing orders. The application also supports payments via Stripe.","imageSrc":"/images/projects/ecommerceapp.svg","url":"https://perezbackery.herokuapp.com/"},{"id":"6","title":"Carousel Developers Package","description":"This carousel library is a type of software library that enables the creation of carousels, also known as image sliders or image rotators. Carousels are often used on websites and applications to display a series of images, videos, or text in a rotating, looping fashion.","imageSrc":"/images/projects/carousel.svg","url":"https://github.com/Collins87mbathi/carousel-with-Reactjs"}],"services":[{"id":"1","title":"Automation Testing","description":"I test software and other technological products to ensure they meet stringent requirements."},{"id":"2","title":"Development","description":"In charge of creating and improving software and applications. This includes research, design, and development of software. Analysts and computer engineers working together to achieve the proposed software application performance"},{"id":"3","title":"Web Design","description":"Design, which is sometimes misunderstood as the superficial process of creating, executing, or constructing the appearance of a product, actually entails much more. "}],"aboutpara":"Hello there! My name is Collins Mbathi, And I work as a software engineer, technical writer and community advocate. I live in Nairobi.\n\n I have two years of experience writing JavaScript code, and I've created personal projects as well as excellent client websites, some of which are used by the community to solve everyday problems. I also write articles in which I discuss how to develop applications, write tests, integrate with CircleCI and other CI/CD platforms, and document.\n\n\nAs a community supporter, I give talks and introduce newcomers to the world of technology, and I am a core leader at Google Developers Student Club.\n\nHere are a few technologies I've recently worked with:\n\nFigma,\nSanity.io,\nReact JS,\nNext JS,\nNode JS,\nExpress JS,\nMongoDB,\nMysql,\nGit,\n GitHub,\n Docker,\nAWS Heroku,\nDigital Ocean,\n\nI'm actively looking for a new job as a Software Engineer and would like to be notified of any new openings."}